{
    "ahadith": [
        {
            "id": 1,
            "header": "Narrated Abu Huraira:",
            "hadith_english": "Allah's Messenger (ﷺ) said: \"When the month of Ramadan starts, the gates of the heaven are opened and the gates of Hell are closed and the devils are chained.\"",
            "narrator": "Abu Huraira",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Fasting",
            "topic": "Fasting",
            "url": "http://sunnah.com/bukhari/30/9"
        },
        {
            "id": 2,
            "header": "Narrated Ibn Umar",
            "hadith_english": "Ibn Umar reported that the Messenger of Allah (ﷺ), when he stood up for prayer, used to raise his hands apposite the shoulders and then recited takbir (Allah-o-Akbar), and when he was about to bow he again did like it and when he raised himself from the ruku' (bowing posture) he again did like it, but he did not do it at the time of raising his head from prostration.",
            "narrator": "Ibn Umar",
            "book": "Sahih Muslim",
            "chapter": "The Book of Prayers",
            "topic": "Prayer",
            "url": "http://sunnah.com/muslim/4/25"
        },
        {
            "id": 3,
            "header": "It is narrated on the authority of Abu Ayyub that a man came to the Prophet (ﷺ) and said:",
            "hadith_english": "Direct me to a deed which draws me near to Paradise and takes me away from the Fire (of Hell). Upon this he (ﷺ) said: You worship Allah and never associate anything with Him, establish prayer, and pay Zakat, and do good to your kin. When he turned his back, the Messenger of Allah (ﷺ) remarked: If he adheres to what he has been ordered to do, he would enter Paradise.",
            "narrator": "Abu Ayyub",
            "book": "Sahih Muslim",
            "chapter": "The Book of Faith",
            "topic": "Faith",
            "url": "http://sunnah.com/muslim/1/14"
        },
        {
            "id": 4,
            "header": "Narrated Abu Huraira:",
            "hadith_english": "The Prophet (ﷺ) said: \"Faith (Belief) consists of more than sixty branches (i.e. parts). And Haya (This term \"Haya\" covers a large number of concepts which are to be taken together; amongst them are self respect, modesty, bashfulness, and scruple, etc.) is a part of faith.\"",
            "narrator": "Abu Huraira",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/2"
        },
        {
            "id": 5,
            "header": "Narrated 'Abdullah bin 'Amr:",
            "hadith_english": "The Prophet (ﷺ) said: \"A Muslim is the one who avoids harming Muslims with his tongue and hands. And a Muhajir (emigrant) is the one who gives up (abandons) all what Allah has forbidden.\"",
            "narrator": "Abdullah bin 'Amr",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/3"
        },
        {
            "id": 6,
            "header": "Narrated Anas:",
            "hadith_english": "The Prophet (ﷺ) said: \"None of you will have faith till he wishes for his (Muslim) brother what he likes for himself.\"",
            "narrator": "Anas",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/6"
        },
        {
            "id": 7,
            "header": "Narrated Abu Huraira:",
            "hadith_english": "Allah's Messenger (ﷺ) said: \"By Him in Whose Hands my life is, none of you will have faith till he loves me more than his father and his children.\"",
            "narrator": "Abu Huraira",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/7"
        },
        {
            "id": 8,
            "header": "Narrated Anas:",
            "hadith_english": "The Prophet (ﷺ) said: \"None of you will have faith till he loves me more than his father, his children and all mankind.\"",
            "narrator": "Anas",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/8"
        },
        {
            "id": 9,
            "header": "Narrated Anas:",
            "hadith_english": "The Prophet (ﷺ) said: \"Love for the Ansar is a sign of faith and hatred for the Ansar is a sign of hypocrisy.\"",
            "narrator": "Anas",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/10"
        },
        {
            "id": 10,
            "header": "Narrated Abu Said Al-Khudri:",
            "hadith_english": "Allah's Messenger (ﷺ) said: \"A time will soon come when the best property of a Muslim will be sheep which he will take on the top of mountains and the places of rainfall (valleys) so as to flee with his religion from afflictions.\"",
            "narrator": "Abu Said Al-Khudri",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/12"
        },
        {
            "id": 11,
            "header": "Narrated Abu Said Al-Khudri:",
            "hadith_english": "The Prophet (ﷺ) said: \"When the people of Paradise will enter Paradise and the people of Hell will go to Hell, Allah will order those who have had faith equal to the weight of a grain of mustard seed to be taken out from Hell. So they will be taken out but (by then) they will be blackened (charred). Then they will be put in the river of Haya' (rain) or Hayat (life) (the Narrator is in doubt as to which is the right term), and they will revive like a grain that grows near the bank of a flood channel. Don't you see that it comes out yellow and twisted.\"",
            "narrator": "Abu Said Al-Khudri",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/15"
        },
        {
            "id": 12,
            "header": "Narrated Ibn 'Umar:",
            "hadith_english": "Allah's Messenger (ﷺ) said: \"I have been ordered (by Allah) to fight against the people until they testify that none has the right to be worshipped but Allah and that Muhammad is Allah's Messenger (ﷺ), and offer the prayers perfectly and give the obligatory charity, so if they perform that, then they save their lives and property from me except for Islamic laws and then their reckoning (accounts) will be done by Allah.\"",
            "narrator": "Ibn 'Umar",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/18"
        },
        {
            "id": 13,
            "header": "Narrated Abu Huraira:",
            "hadith_english": "Allah's Messenger (ﷺ) was asked, \"What is the best deed?\" He replied, \"To believe in Allah and His Apostle (Muhammad). The questioner then asked, \"What is the next (in goodness)? He replied, \"To participate in Jihad (religious fighting) in Allah's Cause.\" The questioner again asked, \"What is the next (in goodness)?\" He replied, \"To perform Hajj (Pilgrim age to Mecca) 'Mubrur, (which is accepted by Allah and is performed with the intention of seeking Allah's pleasure only and not to show off and without committing a sin and in accordance with the traditions of the Prophet).\"",
            "narrator": "Abu Huraira",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/19"
        },
        {
            "id": 14,
            "header": "Narrated 'Abdullah bin 'Amr:",
            "hadith_english": "A person asked Allah's Messenger (ﷺ): \"What (sort of) deeds in or (what qualities of) Islam are good?\" He replied, \"To feed (the poor) and greet those whom you know and those whom you don't know.\"",
            "narrator": "Abdullah bin 'Amr",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/21"
        },
        {
            "id": 15,
            "header": "Narrated Ibn 'Abbas:",
            "hadith_english": "The Prophet (ﷺ) said: \"I was shown the Hell-fire and that the majority of its dwellers were women who were ungrateful.\" It was asked, \"Do they disbelieve in Allah?\" (or are they ungrateful to Allah?) He replied, \"They are ungrateful to their husbands and are ungrateful for the favors and the good (charitable deeds) done to them. If you have always been good (benevolent) to one of them and then she sees something in you (not of her liking), she will say, 'I have never received any good from you.\"",
            "narrator": "Ibn 'Abbas",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/22"
        },
        {
            "id": 16,
            "header": "Narrated Al-Ahnaf bin Qais:",
            "hadith_english": "While I was going to help this man ('Ali Ibn Abi Talib), Abu Bakra met me and asked, \"Where are you going?\" I replied, \"I am going to help that person.\" He said, \"Go back for I have heard Allah's Messenger (ﷺ) saying, 'When two Muslims fight (meet) each other with their swords, both the murderer as well as the murdered will go to the Hell-fire.' I said, 'O Allah's Messenger (ﷺ)! It is all right for the murderer but what about the murdered one?' Allah's Messenger (ﷺ) replied, \"He surely had the intention to kill his companion.\"",
            "narrator": "Al-Ahnaf bin Qais",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/24"
        },
        {
            "id": 17,
            "header": "Narrated 'Abdullah:",
            "hadith_english": "When the following Verse was revealed: \"It is those who believe and confuse not their belief with wrong (worshipping others besides Allah.)\" (6:83), the companions of Allah's Messenger (ﷺ) asked, \"Who is amongst us who had not done injustice (wrong)?\" Allah revealed: \"No doubt, joining others in worship with Allah is a great injustice (wrong) indeed.\"",
            "narrator": "Abdullah",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/25"
        },
        {
            "id": 18,
            "header": "Narrated Abu Huraira:",
            "hadith_english": "Allah's Messenger (ﷺ) said: \"Whoever establishes the prayers on the night of Qadr out of sincere faith and hoping to attain Allah's rewards (not to show off) then all his past sins will be forgiven.\"",
            "narrator": "Abu Huraira",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/28"
        },
        {
            "id": 19,
            "header": "Narrated Abu Huraira:",
            "hadith_english": "Allah's Messenger (ﷺ) said: \"Whoever observes fasts during the month of Ramadan out of sincere faith, and hoping to attain Allah's rewards, then all his past sins will be forgiven.\"",
            "narrator": "Abu Huraira",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/31"
        },
        {
            "id": 20,
            "header": "Narrated Abu Sa'id Al Khudri:",
            "hadith_english": "Allah's Messenger (ﷺ) said: \"If a person embraces Islam sincerely, then Allah shall forgive all his past sins, and after that starts the settlement of accounts, the reward of his good deeds will be ten times to seven hundred times for each good deed and one evil deed will be recorded as it is unless Allah forgives it.\"",
            "narrator": "Abu Sa'id Al Khudri",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/34"
        },
        {
            "id": 21,
            "header": "Narrated 'Aisha:",
            "hadith_english": "Once the Prophet (ﷺ) came while a woman was sitting with me. He said: \"Who is she?\" I replied, \"She is so and so,\" and told him about her (excessive) praying. He said disapprovingly, \"Do (good) deeds which is within your capacity (without being overtaxed) as Allah does not get tired (of giving rewards) but (surely) you will get tired and the best deed (act of Worship) in the sight of Allah is that which is done regularly.\"",
            "narrator": "'Aisha",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/36"
        },
        {
            "id": 22,
            "header": "Narrated Anas:",
            "hadith_english": "The Prophet (ﷺ) said: \"Whoever said \"None has the right to be worshipped but Allah and has in his heart good (faith) equal to the weight of a barley grain will be taken out of Hell. And whoever said: \"None has the right to be worshipped but Allah and has in his heart good (faith) equal to the weight of a wheat grain will be taken out of Hell. And whoever said: \"None has the right to be worshipped but Allah and has in his heart good (faith) equal to the weight of an atom will be taken out of Hell.\"",
            "narrator": "Anas",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/37"
        },
        {
            "id": 23,
            "header": "Narrated 'Umar bin Al-Khattab:",
            "hadith_english": "Once a Jew said to me, \"O the chief of believers! There is a verse in your Holy Book Which is read by all of you (Muslims), and had it been revealed to us, we would have taken that day (on which it was revealed as a day of celebration.\" 'Umar bin Al-Khattab asked: \"Which is that verse?\" The Jew replied: \"This day I have perfected your religion For you, completed My favor upon you, And have chosen for you Islam as your religion.\" (5:3) 'Umar replied, \"No doubt, we know when and where this verse was revealed to the Prophet. It was Friday and the Prophet (ﷺ) was standing at 'Arafat (i.e. the Day of Hajj).\"",
            "narrator": "Umar bin Al-Khattab",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/38"
        },
        {
            "id": 24,
            "header": "Narrated Abu Huraira:",
            "hadith_english": "Allah's Messenger (ﷺ) said: \"(A believer) who accompanies the funeral procession of a Muslim out of sincere faith and hoping to attain Allah's reward and remains with it till the funeral prayer is offered and the burial ceremonies are over, he will return with a reward of two Qirats. Each Qirat is like the size of the (Mount) Uhud. He who offers the funeral prayer only and returns before the burial, will return with the reward of one Qirat only.\"",
            "narrator": "Abu Huraira",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/40"
        },
        {
            "id": 25,
            "header": "Narrated 'Abdullah:",
            "hadith_english": "The Prophet (ﷺ) said: \"Abusing a Muslim is Fusuq (an evil doing) and killing him is Kufr (disbelief).\"",
            "narrator": "Abdullah",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/41"
        },
        {
            "id": 26,
            "header": "Narrated 'Ubada bin As-Samit:",
            "hadith_english": "\"Allah's Messenger (ﷺ) went out to inform the people about the (date of the) night of decree (Al-Qadr) but there happened a quarrel between two Muslim men. The Prophet (ﷺ) said, \"I came out to inform you about (the date of) the night of Al-Qadr, but as so and so and so and so quarrelled, its knowledge was taken away (I forgot it) and maybe it was better for you. Now look for it in the 7th, the 9th and the 5th (of the last 10 nights of the month of Ramadan).\"",
            "narrator": "Ubada bin As-Samit",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/42"
        },
        {
            "id": 27,
            "header": "Narrated 'Umar bin Al-Khattab:",
            "hadith_english": "Allah's Messenger (ﷺ) said: \"The reward of deeds depends upon the intention and every person will get the reward according to what he has intended. So whoever emigrated for Allah and His Apostle, then his emigration was for Allah and His Apostle. And whoever emigrated for worldly benefits or for a woman to marry, his emigration was for what he emigrated for.\"",
            "narrator": "Umar bin Al-Khattab",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/47"
        },
        {
            "id": 28,
            "header": "Narrated Abu Mas'ud:",
            "hadith_english": "The Prophet (ﷺ) said: \"If a man spends on his family (with the intention of having a reward from Allah) sincerely for Allah's sake then it is a (kind of) alms-giving in reward for him.\"",
            "narrator": "Abu Mas'ud",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/48"
        },
        {
            "id": 29,
            "header": "Narrated Sa'd bin Abi Waqqas:",
            "hadith_english": "Allah's Messenger (ﷺ) said: \"You will be rewarded for whatever you spend for Allah's sake even if it were a morsel which you put in your wife's mouth.\"",
            "narrator": "Sa'd bin Abi Waqqas",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/49"
        },
        {
            "id": 30,
            "header": "Narrated Ziyad bin'Ilaqa:",
            "hadith_english": "I heard Jarir bin 'Abdullah (Praising Allah). On the day when Al-Mughira bin Shu'ba died, he (Jarir) got up (on the pulpit) and thanked and praised Allah and said: \"Be afraid of Allah alone Who has none along with Him to be worshipped.(You should) be calm and quiet till the (new) chief comes to you and he will come to you soon. Ask Allah's forgiveness for your (late) chief because he himself loved to forgive others.\" Jarir added, \"Amma badu (now then), I went to the Prophet and said, 'I give my pledge of allegiance to you for Islam.\" The Prophet (ﷺ) conditioned (my pledge) for me to be sincere and true to every Muslim so I gave my pledge to him for this. By the Lord of this mosque! I am sincere and true to you (Muslims). Then Jarir asked for Allah's forgiveness and came down (from the pulpit).",
            "narrator": "Ziyad bin'Ilaqa",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Belief",
            "topic": "Belief",
            "url": "http://sunnah.com/bukhari/2/51"
        },
        {
            "id": 31,
            "header": "Narrated 'Umar bin Al-Khattab:",
            "hadith_english": "I heard Allah's Messenger (ﷺ) saying: \"The reward of deeds depends upon the intentions and every person will get the reward according to what he has intended. So whoever emigrated for worldly benefits or for a woman to marry, his emigration was for what he emigrated for.\"",
            "narrator": "Umar bin Al-Khattab",
            "book": "Sahih Al-Bukhari",
            "chapter": "The Book of Revelation",
            "topic": "Revelation",
            "url": "http://sunnah.com/bukhari/1/1"
        }
    ]
}